# ICN Programming Course

<p align="center">
    <img width="500" alt="image" src="https://github.com/Lenakeiz/ICN_Programming_Course/blob/main/Images/cog_neuro_logo_blue_png_0.png?raw=true">
</p>

---

## Pandas
In this part of the lesson we are going to present one of the tools you will most likely use for .

[Pandas library](https://pandas.pydata.org/) defines and makes use of a new _data structure_, _i.e._ the `DataFrame`. 
Actually pandas define more than just a data structure, for instance we will make use of `Series` and examine the difference with dataframes.

### Advantages of pandas

Data scientists use Pandas for its following advantages:

* Easily handles missing data;
* It provides an efficient way to slice the data;
* It provides a flexible way to merge, concatenate or reshape the data;
* It includes a powerful data casting tool to work with;
* It wraps data visualisation libraries in order to quickly plotting analysis results.

Tthe main disadvantage of pandas is that it is relegated to manipulate dataframes whose dimension is strictly lower than memory.
### Dataframes

A `DataFrame` is a table. As any other type in python, it is defined as a class, with its attributes and methods. 
You can check the [documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html) to see the class APIs and see it s capability

More formally, it is a rank-$2$ array, with axes labelled as _rows_ and _columns_.
It is the basic object in pandas and a really common way to load data in memory in order to operate on them.

Now the question you are all wondering: how to _create a dataframe_. There are several ways, by tuples, by lists, by numpy arrays or even by dictionaries. 
As a first instance, let's consider a list of names corresponding to people and their age, you can create a data frame in this way:

In [1]:
import pandas as pd # pd is a standard alias for pandas library.

In [ ]:

# List of lists made by [str, int]
lst = [['mario', 25], ['billy', 30], ['lakitu', 26], ['bowser', 22]]

df = pd.DataFrame(lst, columns=['Name', 'Age'])
df

In [ ]:
# Dict made by {str: int}
data_dict = {'mario': 25, 'billy': 30, 'lakitu': 26, 'bowser': 22}

df = pd.DataFrame(data=data_dict.items(), columns=['Name', 'Age'])
df

In [ ]:
# Read from csv file
df = pd.read_csv('datasets/people.csv', header=None, names=['Name', 'Age'])
df

In [ ]:
# Read from a numpy array
import numpy as np

arr = np.array([['mario', 25], ['billy', 30], ['lakitu', 26], ['bowser', 22]])
df = pd.DataFrame(arr, columns=['Name', 'Age'])
df

As you can see we have the exact same object.
Once data are organised in the dataframe, no matter how we imported them, they are stored in that object that has always the same methods and attributes.

### Series

A `Series` is a one-dimensional data structure. It can have any data structure like integer, float, and string, or even composite ones like lists, dictionaries, etc. 

It is useful when you want to perform computation or return a one-dimensional array.
A series, by definition, cannot have multiple columns.
For the latter case, use the data frame structure, which indeed can be considered as made up by series.

Series has one parameters, the data, that can be a list, a dictionary, or a scalar value:

In [ ]:
pd.Series([1., 2., 3.])

### Read from files

Data can be loaded in a DataFrame from different data format, like csv, xlx, json, etc.

The most common file type is the csv (comma separated values).
You can load them into a `Dataframe` using `read_csv` method, eventually specifying also the type of delimeter used for separating the values.

In [ ]:
df_travel = pd.read_csv('datasets/travel_blog_data.csv', delimiter=';')
df_travel

This dataset holds the user activity data from a travel blog. 

It is noteworthy a default behaviour in pandas `read_csv`.
The csv file do not have a header row, therefore pandas used the first row of data as header; in order to set the name of the columns you can use the `name` parameter.

In [ ]:
df_travel = pd.read_csv('datasets/travel_blog_data.csv', delimiter=';',
                 names=['timestamp', 'event', 'country', 'user_id', 'source', 'topic'],
                 parse_dates=True)
df_travel.shape

Sometimes, it might be handy not to print the whole dataframe and flood your screen with data. 
When a few lines is enough, you can print only the first $n$ lines – by typing:

```python
df_travel.head(n)
```

If you leave the $n$ parameter blank, the method takes the default value, that is $5$.

In [ ]:
df_travel.head(20)

By symmetry, you can imagine what the `tail` method returns.

In [ ]:
df_travel.tail()

We might also need a random sampling of $k$ lines out of the dataframe, this can be achieved by the `sample` method.

In [ ]:
df_travel.sample(7)

Other two dataframe methods that are very useful in analysing data are `describe` and `info`.

The `describe` method allows to get some statistical information about our data.

In [ ]:
print(type(df_travel.describe()))
df_travel.describe()

Note how the result is again a dataframe whose index is a list of statistical properties, and as columns the values of indexed properties for the first available numerical column (in our case `user_id`).

As one can read in the [docs](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.describe.html) the method returns a Summary statistics of the Series or Dataframe provided.

Again, from the official documentation 

> For numeric data, the result’s index will include `count`, `mean`, `std`, `min`, `max` as well as lower, $50$ and upper percentiles. By default the lower percentile is $25$ and the upper percentile is $75$. The $50$ percentile is the same as the median.
>
> For object data (e.g. strings or timestamps), the result’s index will include `count`, `unique`, `top`, and `freq`. The `top` is the most common value. The `freq` is the most common value’s frequency. `Timestamps` also include the first and last items.
>
> If multiple object values have the highest count, then the `count` and `top` results will be arbitrarily chosen from among those with the highest count.
>
> _For mixed data types provided via a DataFrame, the default is to return only an analysis of numeric columns. If the dataframe consists only of object and categorical data without any numeric columns, the default is to return an analysis of both the object and categorical columns. If include='all' is provided as an option, the result will include a union of attributes of each type._
>
> The include and exclude parameters can be used to limit which columns in a DataFrame are analyzed for the output. The parameters are ignored when analyzing a Series.

We can however try to override the default behaaviour and we can do so by setting `include='all'` parameter.

In [ ]:
df_travel.describe(include='all')

On the other hand, we also have `info` method.

In [ ]:
dataframe_info  = df_travel.info()
dataframe_info

This method actually returns a `NoneType`. But in the execution _prints_ on screen some information about the dataframe. 
It is less informative (almost not informative at all) from the statistics point of view, but it tells us some numerical property of the dataframe, indeed this method prints information about the DataFrame including the index `dtype` and columns, non-null values and memory usage.

Interesting enough the first colum however should be able to be parsed into an object more easy to read. 
In particular, since the column clearly represents a date we can transform it into an object that is more recognisibile.
We can parse it into `datetime` object.

In [ ]:
# Using the dadtaframe function to_datetime() to convert the timestamp column to datetime
# Saving the output directly to the timestamp column by replacing it
df_travel['timestamp'] = pd.to_datetime(df_travel['timestamp'])
df_travel.info()

# Extracting date and time from the first row
first_row_timestamp = df_travel.loc[0, 'timestamp']
extracted_date = first_row_timestamp.date()
extracted_time = first_row_timestamp.time()

print("Date from the first row:", extracted_date)
print("Time from the first row:", extracted_time)

The last descriptive method we present here is the `corr` one. 
By using such a method we can generate the relationship between each numerical variables.
This function will throw an error if you load a dataset that does not contain numerical values.

In [2]:
df_memory = pd.read_csv('datasets/memory_recall_test.csv', delimiter=',')
df_memory.head()

correlation_matrix = df_memory.corr()
correlation_matrix

,Age (Years),Reaction Time (Milliseconds),Memory Recall Score (Out of 100),Stress Level (Scale 1-10)
Age (Years),1.000000,0.944092,-0.871905,0.957697
Reaction Time (Milliseconds),0.944092,1.000000,-0.941544,0.905633
Memory Recall Score (Out of 100),-0.871905,-0.941544,1.000000,-0.868204
Stress Level (Scale 1-10),0.957697,0.905633,-0.868204,1.000000

### Filter by selecting columns

Sometimes you will need to only work with specific columns from a dataset.
You can do so by using the two following and equivalent syntaxes.
The second syntax is less flexible as it required the column names to be in a certain way.

In [3]:
# first way, the square bracket notation
age = df_memory['Age (Years)']
print(type(age))

<class 'pandas.core.series.Series'>

In [4]:
# second way, the point notation
# the column name must not contain spaces, special characters, or starts with a number
# if you want to use dot notation, you would need to rename the column to remove spaces and special characters.
# for example:
df_memory.rename(columns={'Age (Years)': 'Age_years'}, inplace=True)

# the inplace parameter is used to modify the dataframe in place, without creating a new dataframe object otherwise you would need to assign the output to a new variable
# new_df_memory = df_memory.rename(columns={'Age (Years)': 'Age_years'})
age = df_memory.Age_years
print(type(age))

<class 'pandas.core.series.Series'>

<div class="alert alert-block alert-info">
⚠️ Both of the previous syntaxes return a <em>Series</em> rather than a <em>Dataframe</em>
</div>

If you want a dataframe, you need to slightly change the previous commands in

In [ ]:
# Hard way, no one uses that.
pd.DataFrame(df_memory.Age_years)

In [ ]:
# Easy way, it generalises easily to the multi-column case.
age = df_memory[['Age_years']]
print(type(age))

#### What about multi-column filter?

As the previous cell might suggest, you only need to pass a list of columns.

Note the double bracket `[[]]`, you can consider `[]` as a _filter_ operator, whose argument is the `list` of column names.
Recall that a `Series` admits only one column, hence the result of this operation cannot be other than a dataframe.

In [7]:
# just reloading the data to make sure we have the original data
df_travel = pd.read_csv('datasets/travel_blog_data.csv', delimiter=';',
                 names=['timestamp', 'event', 'country', 'user_id', 'source', 'topic'],
                 parse_dates=True)

df_travel

                timestamp event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
2     2018-01-01 00:04:01  read  country_7  2458151263  AdWords         Africa
3     2018-01-01 00:04:02  read  country_7  2458151264  AdWords         Europe
4     2018-01-01 00:05:03  read  country_8  2458151265   Reddit  North America
...                   ...   ...        ...         ...      ...            ...
1790  2018-01-01 23:57:14  read  country_2  2458153051  AdWords  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1793  2018-01-01 23:59:36  read  country_7  2458153054  AdWords         Europe
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[1795 rows x 6 columns]

In [6]:

df_travel[['user_id','country']]

         user_id    country
0     2458151261  country_7
1     2458151262  country_7
2     2458151263  country_7
3     2458151264  country_7
4     2458151265  country_8
...          ...        ...
1790  2458153051  country_2
1791  2458153052  country_8
1792  2458153053  country_6
1793  2458153054  country_7
1794  2458153055  country_5

[1795 rows x 2 columns]

The order of names changes the order in the returned dataframe.

In [8]:
df_travel[['country', 'user_id']]

        country     user_id
0     country_7  2458151261
1     country_7  2458151262
2     country_7  2458151263
3     country_7  2458151264
4     country_8  2458151265
...         ...         ...
1790  country_2  2458153051
1791  country_8  2458153052
1792  country_6  2458153053
1793  country_7  2458153054
1794  country_5  2458153055

[1795 rows x 2 columns]

### Filter rows on values

There is complementary way of filtering a dataframe, on rows value. Hence, we can reduce the number of records in the dataframe based on some condition.

Let's use the imnported travel dataframe, and for instance, you want to see the entries corresponding to the users who came from the "SEO" source. In this case you have to filter for the "SEO" value in the "source" column.

In [9]:
df_travel[df_travel.source == 'SEO']

                timestamp event    country     user_id source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11    2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15    2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16    2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America
...                   ...   ...        ...         ...    ...            ...
1772  2018-01-01 23:45:58  read  country_7  2458153033    SEO  South America
1777  2018-01-01 23:49:52  read  country_5  2458153038    SEO  North America
1779  2018-01-01 23:51:25  read  country_4  2458153040    SEO  South America
1784  2018-01-01 23:54:03  read  country_2  2458153045    SEO  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052    SEO           Asia

[346 rows x 6 columns]

In order to better understand the command above, let's focus on how pandas interpret the filtering procedure.

**Step 1**: First, between the bracket frames `[]` it evaluates every line: is the `df.source` column’s value `'SEO'` or not? The results are boolean values (True or False), better a `Series` of boolean values. 
Indeed, we have seen how `df.source` is a series, a comparison with a value (through the binary operator `==`) will produce a truth-value object of the same type of `df.source` hence a series.

In [10]:

# Note the dtype attribute
df_travel.source == 'SEO'

0        True
1        True
2       False
3       False
4       False
        ...
1790    False
1791     True
1792    False
1793    False
1794    False
Name: source, Length: 1795, dtype: bool

**step 2**: The previous boolean series is what is called a _mask_.
If we filter through a mask, the filtered dataframes returns every row where the mask is `True` and drops any row where it is `False`.
This is equivalent to the logical indexing in `Matlab`

In [11]:
# A less concise, but maybe clearer notation
mask_seo = (df_travel.source == 'SEO') # Boolean series
print(type(mask_seo))
df_travel[mask_seo] # Masks away the rows corresponding to "False".

<class 'pandas.core.series.Series'>

                timestamp event    country     user_id source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261    SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262    SEO  South America
11    2018-01-01 00:08:57  read  country_7  2458151272    SEO      Australia
15    2018-01-01 00:11:22  read  country_7  2458151276    SEO  North America
16    2018-01-01 00:13:05  read  country_8  2458151277    SEO  North America
...                   ...   ...        ...         ...    ...            ...
1772  2018-01-01 23:45:58  read  country_7  2458153033    SEO  South America
1777  2018-01-01 23:49:52  read  country_5  2458153038    SEO  North America
1779  2018-01-01 23:51:25  read  country_4  2458153040    SEO  South America
1784  2018-01-01 23:54:03  read  country_2  2458153045    SEO  North America
1791  2018-01-01 23:58:33  read  country_8  2458153052    SEO           Asia

[346 rows x 6 columns]

It is obvious now that you can combine more conditions to end up into a boolean mask and apply even complicated filter.

_Example_: We want to filter the dataframe to get all the users coming from a "SEO" source, with topic related to "Asia" and with a timestamp between 23.00 and 23.30.

In [13]:
bool_mask = ((df_travel.source == 'SEO') & (df_travel.topic == 'Asia') & (df_travel.timestamp >= '2018-01-01 23:00:00') & (df_travel.timestamp <= '2018-01-01 23:30:00'))
df_travel[bool_mask]

                timestamp event    country     user_id   source          topic
0     2018-01-01 00:01:01  read  country_7  2458151261      SEO  North America
1     2018-01-01 00:03:20  read  country_7  2458151262      SEO  South America
10    2018-01-01 00:07:57  read  country_5  2458151271  AdWords           Asia
11    2018-01-01 00:08:57  read  country_7  2458151272      SEO      Australia
12    2018-01-01 00:09:11  read  country_5  2458151273   Reddit           Asia
...                   ...   ...        ...         ...      ...            ...
1787  2018-01-01 23:54:45  read  country_2  2458153048   Reddit           Asia
1789  2018-01-01 23:56:42  read  country_4  2458153050  AdWords           Asia
1791  2018-01-01 23:58:33  read  country_8  2458153052      SEO           Asia
1792  2018-01-01 23:59:36  read  country_6  2458153053   Reddit           Asia
1794  2018-01-01 23:59:38  read  country_5  2458153055   Reddit           Asia

[979 rows x 6 columns]

### Creating new columns

Creating a new column is easy, you simply _declare_ the new column name as `df["new_col"] =  new_col` where `new_col` is a pandas Series.
The new column will be filled with `NaN`` (Not a Number, which is Pandas' standard missing data marker) for all rows where the Series does not have a corresponding index.

You can also calculate the new column entries by operating on existing ones.

In [14]:
# Create a new column as the string concatenation of "country" and "topic"
df_travel["contry_code_per_continent"] = df_travel.country + "||" + df_travel.topic
df_travel

,timestamp,event,country,user_id,source,topic,contry_code_per_continent
0,2018-01-01 00:01:01,read,country_7,2458151261,SEO,North America,country_7||North America
1,2018-01-01 00:03:20,read,country_7,2458151262,SEO,South America,country_7||South America
2,2018-01-01 00:04:01,read,country_7,2458151263,AdWords,Africa,country_7||Africa
3,2018-01-01 00:04:02,read,country_7,2458151264,AdWords,Europe,country_7||Europe
4,2018-01-01 00:05:03,read,country_8,2458151265,Reddit,North America,country_8||North America
...,...,...,...,...,...,...,...
1790,2018-01-01 23:57:14,read,country_2,2458153051,AdWords,North America,country_2||North America
1791,2018-01-01 23:58:33,read,country_8,2458153052,SEO,Asia,country_8||Asia
1792,2018-01-01 23:59:36,read,country_6,2458153053,Reddit,Asia,country_6||Asia
1793,2018-01-01 23:59:36,read,country_7,2458153054,AdWords,Europe,country_7||Europe
1794,2018-01-01 23:59:38,read,country_5,2458153055,Reddit,Asia,country_5||Asia

In [16]:
# Create a further column made by the 2nd letter of the string contained in the "event" column
df_travel["part_string"] = df_travel.event.str[1]
df_travel

,timestamp,event,country,user_id,source,topic,contry_code_per_continent,part_string
0,2018-01-01 00:01:01,read,country_7,2458151261,SEO,North America,country_7||North America,e
1,2018-01-01 00:03:20,read,country_7,2458151262,SEO,South America,country_7||South America,e
2,2018-01-01 00:04:01,read,country_7,2458151263,AdWords,Africa,country_7||Africa,e
3,2018-01-01 00:04:02,read,country_7,2458151264,AdWords,Europe,country_7||Europe,e
4,2018-01-01 00:05:03,read,country_8,2458151265,Reddit,North America,country_8||North America,e
...,...,...,...,...,...,...,...,...
1790,2018-01-01 23:57:14,read,country_2,2458153051,AdWords,North America,country_2||North America,e
1791,2018-01-01 23:58:33,read,country_8,2458153052,SEO,Asia,country_8||Asia,e
1792,2018-01-01 23:59:36,read,country_6,2458153053,Reddit,Asia,country_6||Asia,e
1793,2018-01-01 23:59:36,read,country_7,2458153054,AdWords,Europe,country_7||Europe,e
1794,2018-01-01 23:59:38,read,country_5,2458153055,Reddit,Asia,country_5||Asia,e

### Sequential filtering and masks 

Filter and mask operations can be used sequentially, one after the other.

It is very important to understand that pandas’s logic is linear. 
So if you apply a function, you can always apply another one on the result. 
In this case, the input of the latter function will always be the output of the previous one. 
This will have a very nice consequence in a construct called `pipe` (see later for details).

As you have already seen, for instance, we can combine two selection methods.

In [18]:
# executed head() first then apply the column selection
df_travel.head()[['country', 'user_id']]

      country     user_id
0   country_7  2458151261
1   country_7  2458151262
2   country_7  2458151263
3   country_7  2458151264
4   country_8  2458151265
5   country_6  2458151266
6   country_2  2458151267
7   country_6  2458151268
8   country_7  2458151269
9   country_5  2458151270
10  country_5  2458151271
11  country_7  2458151272
12  country_5  2458151273
13  country_2  2458151274
14  country_7  2458151275
15  country_7  2458151276
16  country_8  2458151277
17  country_2  2458151278
18  country_4  2458151279
19  country_2  2458151280

This line first selects the first $5$ rows of our dataframe. And then it takes only the ‘country’ and the ‘user_id’ columns.

As these operations are commutative, you would not be surprised by the fact that one can get the same result with the reversed chain of functions.

In [ ]:
df_travel[['country', 'user_id']].head()

In this version, you select the columns first, then take the first five rows. 
The result is the same – just the order of the functions (and the execution) is different.

_Try to think which one is better in terms of computational time._

We can check it by running some very simple test using the Python in-built package time

In [3]:
import time
import pandas as pd
# This dataset is quite large so it s not part of the files you can download from the course page.

df_large_dataset = pd.read_csv('./datasets/large_dataset.csv', delimiter=',')
print(df_large_dataset.shape)

(1000000, 16)

In [4]:
# Initialize total time counters
total_time_first_method = 0
total_time_second_method = 0

iterations = 1000

for _ in range (iterations):
    # Measure time for df_travel[['country', 'user_id']].head()
    start_time = time.time()
    df_large_dataset[['country', 'user_id']].head(100)
    end_time = time.time()
    total_time_first_method += end_time - start_time

    # Measure time for df_travel.head()[['country', 'user_id']]
    start_time = time.time()
    df_large_dataset.head(100)[['country', 'user_id']]
    end_time = time.time()
    total_time_second_method += end_time - start_time

# Compute average time for each method
time_first_method = total_time_first_method / iterations
time_second_method = total_time_second_method / iterations

print(f"Time for first method: {time_first_method:6f} seconds")
print(f"Time for second method: {time_second_method:6f} seconds")

Time for first method: 0.009771 seconds
Time for second method: 0.000483 seconds

There a lot of interesting ways of selecting columns out of a dataframe. 
Look at this [nice post](https://towardsdatascience.com/interesting-ways-to-select-pandas-dataframe-columns-b29b82bbfb33#:~:text=Selecting%20columns%20based%20on%20their,Returns%20a%20pandas%20series.&text=Passing%20a%20list%20in%20the,columns%20at%20the%20same%20time.) in order to look at some non-standard examples.

### Aggregations

In Python, particularly in the context of data analysis with libraries like Pandas, "aggregation" refers to the process of combining multiple data points into a single value based on a specified criterion or operation.
This process is crucial in data analysis for summarizing data, extracting insights, and simplifying complex datasets.

Let's consider a new dataset.

In [4]:
zoo = pd.read_csv("datasets/zoo.csv")
zoo

      animal  uniq_id  water_need
0   elephant     1001         500
1   elephant     1002         600
2   elephant     1003         550
3      tiger     1004         300
4      tiger     1005         320
5      tiger     1006         330
6      tiger     1007         290
7      tiger     1008         310
8      zebra     1009         200
9      zebra     1010         220
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
13     zebra     1014         100
14     zebra     1015          80
15      lion     1016         420
16      lion     1017         600
17      lion     1018         500
18      lion     1019         390
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410

Counting the number of the animals is as easy as applying a `count` function on the zoo dataframe.

In [22]:
zoo.count()

animal        22
uniq_id       22
water_need    22
dtype: int64

As one can observe, the `count()` method counts the number of values in each column. 
In the case of the zoo dataset, there were $3$ columns, and each of them had $22$ values in it.

If you want to make your output clearer, you can select the animal column first by using one of the selection operators from the previous section.

In [23]:
zoo[['animal']].count()

animal    22
dtype: int64

Or in this particular case, the result could be even nicer for Series, in fact to show just the number and not the column name nor the type, one can use the following syntax.

In [ ]:
zoo.animal.count()

Here, as before, one can notice how pandas applied functions sequentially. 
First, `zoo.animal` is a Series, then calculated the count of it. 

Indeed an equivalent, even if less compact notation, for this is the following.

In [ ]:
animal_series = zoo.animal
animal_series.count()

Following the same logic, one can sum all the values inside a column by the `sum` method.

In [24]:
zoo.water_need.sum()

np.int64(7650)

You can see there are a lot of methods and one should know in advance what they are and how they works.

In order to get such information, the royal road is to read the documentation. However, a convenient way to get a list of all available methods of a class instance is the function `dir`.

In [25]:
dir(zoo)

['T',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__',
 '__annotations__',
 '__array__',
 '__array_priority__',
 '__array_ufunc__',
 '__arrow_c_stream__',
 '__bool__',
 '__class__',
 '__contains__',
 '__copy__',
 '__dataframe__',
 '__dataframe_consortium_standard__',
 '__deepcopy__',
 '__delattr__',
 '__delitem__',
 '__dict__',
 '__dir__',
 '__divmod__',
 '__doc__',
 '__eq__',
 '__finalize__',
 '__floordiv__',
 '__format__',
 '__ge__',
 '__getattr__',
 '__getattribute__',
 '__getitem__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__iadd__',
 '__iand__',
 '__ifloordiv__',
 '__imod__',
 '__imul__',
 '__init__',
 '__init_subclass__',
 '__invert__',
 '__ior__',
 '__ipow__',
 '__isub__',
 '__iter__',
 '__itruediv__',
 '__ixor__',
 '__le__',
 '__len__',
 '__lt__',
 '__matmul__',
 '__mod__',
 '__module__',
 '__mul__',
 '__ne__',
 '__neg__',
 '__new__',
 '__nonzero__',
 '__or__',
 '__pandas_priority__',
 '__pos__',
 '__pow__',
 '__radd__',
 '__rand__',
 '__rdivmod__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__rfloordiv__',
 '__rmatmul__',
 '__rmod__',
 '__rmul__',
 '__ror__',
 '__round__',
 '__rpow__',
 '__rsub__',
 '__rtruediv__',
 '__rxor__',
 '__setattr__',
 '__setitem__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__sub__',
 '__subclasshook__',
 '__truediv__',
 '__weakref__',
 '__xor__',
 '_accessors',
 '_accum_func',
 '_agg_examples_doc',
 '_agg_see_also_doc',
 '_align_for_op',
 '_align_frame',
 '_align_series',
 '_append',
 '_arith_method',
 '_arith_method_with_reindex',
 '_as_manager',
 '_attrs',
 '_box_col_values',
 '_can_fast_transpose',
 '_check_inplace_and_allows_duplicate_labels',
 '_check_is_chained_assignment_possible',
 '_check_label_or_level_ambiguity',
 '_check_setitem_copy',
 '_clear_item_cache',
 '_clip_with_one_bound',
 '_clip_with_scalar',
 '_cmp_method',
 '_combine_frame',
 '_consolidate',
 '_consolidate_inplace',
 '_construct_axes_dict',
 '_construct_result',
 '_constructor',
 '_constructor_from_mgr',
 '_constructor_sliced',
 '_constructor_sliced_from_mgr',
 '_create_data_for_split_and_tight_to_dict',
 '_data',
 '_deprecate_downcast',
 '_dir_additions',
 '_dir_deletions',
 '_dispatch_frame_op',
 '_drop_axis',
 '_drop_labels_or_levels',
 '_ensure_valid_index',
 '_find_valid_index',
 '_flags',
 '_flex_arith_method',
 '_flex_cmp_method',
 '_from_arrays',
 '_from_mgr',
 '_get_agg_axis',
 '_get_axis',
 '_get_axis_name',
 '_get_axis_number',
 '_get_axis_resolvers',
 '_get_block_manager_axis',
 '_get_bool_data',
 '_get_cleaned_column_resolvers',
 '_get_column_array',
 '_get_index_resolvers',
 '_get_item_cache',
 '_get_label_or_level_values',
 '_get_numeric_data',
 '_get_value',
 '_get_values_for_csv',
 '_getitem_bool_array',
 '_getitem_multilevel',
 '_getitem_nocopy',
 '_getitem_slice',
 '_gotitem',
 '_hidden_attrs',
 '_indexed_same',
 '_info_axis',
 '_info_axis_name',
 '_info_axis_number',
 '_info_repr',
 '_init_mgr',
 '_inplace_method',
 '_internal_names',
 '_internal_names_set',
 '_is_copy',
 '_is_homogeneous_type',
 '_is_label_or_level_reference',
 '_is_label_reference',
 '_is_level_reference',
 '_is_mixed_type',
 '_is_view',
 '_is_view_after_cow_rules',
 '_iset_item',
 '_iset_item_mgr',
 '_iset_not_inplace',
 '_item_cache',
 '_iter_column_arrays',
 '_ixs',
 '_logical_func',
 '_logical_method',
 '_maybe_align_series_as_frame',
 '_maybe_cache_changed',
 '_maybe_update_cacher',
 '_metadata',
 '_mgr',
 '_min_count_stat_function',
 '_needs_reindex_multi',
 '_pad_or_backfill',
 '_protect_consolidate',
 '_reduce',
 '_reduce_axis1',
 '_reindex_axes',
 '_reindex_multi',
 '_reindex_with_indexers',
 '_rename',
 '_replace_columnwise',
 '_repr_data_resource_',
 '_repr_fits_horizontal_',
 '_repr_fits_vertical_',
 '_repr_html_',
 '_repr_latex_',
 '_reset_cache',
 '_reset_cacher',
 '_sanitize_column',
 '_series',
 '_set_axis',
 '_set_axis_name',
 '_set_axis_nocheck',
 '_set_is_copy',
 '_set_item',
 '_set_item_frame_value',
 '_set_item_mgr',
 '_set_value',
 '_setitem_array',
 '_setitem_frame',
 '_setitem_slice',
 '_shift_with_freq',
 '_should_reindex_frame_op',
 '_slice',
 '_stat_function',
 '_stat_function_ddof',
 '_take_with_is_copy',
 '_to_dict_of_blocks',
 '_to_latex_via_styler',
 '_typ',
 '_update_inplace',
 '_validate_dtype',
 '_values',
 '_where',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'animal',
 'any',
 'apply',
 'applymap',
 'asfreq',
 'asof',
 'assign',
 'astype',
 'at',
 'at_time',
 'attrs',
 'axes',
 'backfill',
 'between_time',
 'bfill',
 'bool',
 'boxplot',
 'clip',
 'columns',
 'combine',
 'combine_first',
 'compare',
 'convert_dtypes',
 'copy',
 'corr',
 'corrwith',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'droplevel',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'eval',
 'ewm',
 'expanding',
 'explode',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'flags',
 'floordiv',
 'from_dict',
 'from_records',
 'ge',
 'get',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'info',
 'insert',
 'interpolate',
 'isetitem',
 'isin',
 'isna',
 'isnull',
 'items',
 'iterrows',
 'itertuples',
 'join',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'map',
 'mask',
 'max',
 'mean',
 'median',
 'melt',
 'memory_usage',
 'merge',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pad',
 'pct_change',
 'pipe',
 'pivot',
 'pivot_table',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'query',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select_dtypes',
 'sem',
 'set_axis',
 'set_flags',
 'set_index',
 'shape',
 'shift',
 'size',
 'skew',
 'sort_index',
 'sort_values',
 'squeeze',
 'stack',
 'std',
 'style',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dict',
 'to_excel',
 'to_feather',
 'to_gbq',
 'to_hdf',
 'to_html',
 'to_json',
 'to_latex',
 'to_markdown',
 'to_numpy',
 'to_orc',
 'to_parquet',
 'to_period',
 'to_pickle',
 'to_records',
 'to_sql',
 'to_stata',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'to_xml',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tz_convert',
 'tz_localize',
 'uniq_id',
 'unstack',
 'update',
 'value_counts',
 'values',
 'var',
 'water_need',
 'where',
 'xs']

By looking at the class function declarations you can start asking questions to your data.

_e.g_ What is the smallest amount of `water_need` for the zoo?

In [26]:
zoo.water_need.min()

np.int64(80)

Similarly, one can find the highest value.

In [27]:
zoo.water_need.max()

np.int64(600)

And eventually, let’s calculate statistical averages, like mean and median.

In [28]:
print(f"Mean {zoo.water_need.mean()} and median {zoo.water_need.median()}")

Mean 347.72727272727275 and median 325.0

### Grouping
Sometimes you will need to do segmentations on your data.
Think about of an experiment where you want to compare different output metrics based on different experimental conditions.
 
For instance, it is nice to know the mean `water_need` of all animals (we have just learned that it is $347.72$).
But very often it is much more actionable to break this number down – let’s say – by animal types. 
With that, we can compare the species to each other – or we can find outliers.

Here is a simplified visual that shows how pandas performs “_segmentation_” (grouping and aggregation) based on the column values.

<p align="center">
    <img width="735" src="https://github.com/Lenakeiz/ICN_Programming_Course/blob/main/main/week_7/grouping_concepts.png?raw=true">
</p>

Let’s apply grouping on our zoo DataFrame. 

Speaking of code, we only have to fit in a `groupby` keyword between our zoo variable and our `mean()` command.

In [31]:
zoo.groupby('animal').mean()

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

This is a very important operation. We aggregated by animal unique values (used as indices in the resulting dataframe) and calculated the mean.
Here the mean has the role of _aggregation function_.
One can use other aggregation functions to get different results.

_e.g._ median, count, list, etc.

For example we could try to implement a custom metric that we want to apply after the aggregation function that takes only the 3rd entry from each given animal. 

<div class="alert alert-block alert-info">
ℹ️ you can use the <em>lambda</em> notation to write functions on a line.
</div>

In [32]:
# Define a lambda function to extract the third entry of each animal
# We'll group by 'animal' and then apply the function to get the third entry
third_entry = lambda x: x.iloc[2] if len(x) > 2 else None

# Apply the aggregation function to the grouped DataFrame
third_entry_df = zoo.groupby('animal').apply(third_entry, include_groups=False)
third_entry_df

          uniq_id  water_need
animal
elephant     1003         550
kangaroo     1022         410
lion         1018         500
tiger        1006         330
zebra        1011         240

Finally, note how `groupby` on its own does not aggregate anything.

In [33]:
df_zoo_group_by = zoo.groupby("animal")
print(type(df_zoo_group_by))
df_zoo_group_by

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

The type of the returned object is a `DataFrameGroupBy`.
It does not have practical uses, apart from the fact that can be iterated to get a dataframe for each group.

This can be very useful if you are planning to do additional analysis on each of the grouped dataframes.

In [34]:
for key, df in zoo.groupby("animal"):
    print(f"This is the key, e.g. the selected animal: {key}")
    print(f"This is the df, e.g. the grouped df by animal: \n {df}")
    print("="*20)
    print("\n")

This is the key, e.g. the selected animal: elephant
This is the df, e.g. the grouped df by animal:
      animal  uniq_id  water_need
0  elephant     1001         500
1  elephant     1002         600
2  elephant     1003         550
====================


This is the key, e.g. the selected animal: kangaroo
This is the df, e.g. the grouped df by animal:
       animal  uniq_id  water_need
19  kangaroo     1020         410
20  kangaroo     1021         430
21  kangaroo     1022         410
====================


This is the key, e.g. the selected animal: lion
This is the df, e.g. the grouped df by animal:
    animal  uniq_id  water_need
15   lion     1016         420
16   lion     1017         600
17   lion     1018         500
18   lion     1019         390
====================


This is the key, e.g. the selected animal: tiger
This is the df, e.g. the grouped df by animal:
   animal  uniq_id  water_need
3  tiger     1004         300
4  tiger     1005         320
5  tiger     1006         330
6  tiger     1007         290
7  tiger     1008         310
====================


This is the key, e.g. the selected animal: zebra
This is the df, e.g. the grouped df by animal:
    animal  uniq_id  water_need
8   zebra     1009         200
9   zebra     1010         220
10  zebra     1011         240
11  zebra     1012         230
12  zebra     1013         220
13  zebra     1014         100
14  zebra     1015          80
====================

### Merge
In our experiments, we usually do not store all the data in one big data table.

We store it in a few smaller ones instead, usually each data table consisting on the data for each single participant.

Apart from the practicality of doing so, there are many reasons behind this; for instance, by using multiple data tables, it is easier to manage your data, easier to avoid redundancy, you can save some disk space, you can query the smaller tables faster, etc.

The point is that it is quite usual that during your analysis you have to pull your data from two or more different tables.
The solution for that is called _merge_ (in computer programmming this is very similar to use `structured query language (SQL)` on databases).

Let’s take our zoo dataframe in which we have all our animals, and let’s say that we have another dataframe, `zoo_eats`, that contains information about the food requirements for each species.

In [3]:
import pandas as pd
# Import dataframe and print it to get a first glance
zoo_eats = pd.read_csv("datasets/zoo_eats.csv")
zoo_eats

     animal        food
0  elephant  vegetables
1     tiger        meat
2  kangaroo  vegetables
3     zebra        meat
4   giraffe  vegetables

As you can see we have the animal column, containing the name of the species and the kind of food they eat.

We want to merge these two tables into one in order to get all the information in the same place.

We can use several way to do that (the most basic one, _strongly_ discouraged is a `for` loop over animal column of `zoo` dataframe). 
One of the most efficient ones is to use the `merge` method of pandas.

In [36]:
zoo.merge(zoo_eats, on="animal") # Here the `on` parameter is not strictly necessary as it is the only column the two df's have in common.

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200        meat
9      zebra     1010         220        meat
10     zebra     1011         240        meat
11     zebra     1012         230        meat
12     zebra     1013         220        meat
13     zebra     1014         100        meat
14     zebra     1015          80        meat
15  kangaroo     1020         410  vegetables
16  kangaroo     1021         430  vegetables
17  kangaroo     1022         410  vegetables

For those familiar with SQL, this is equivalent to an _inner join_ where left table is `zoo` and right `zoo_eats`.
We could have done the opposite just by exchanging the two dataframes.

```python
zoo_eats.merge(zoo, on="animal")
```

This would have just changed the order of columns.

**Obervation**: Can you see there is no lion 🦁, nor giraffe 🦒? Can you tell why?

The followings are the type of joins that you can operate similar to SQL.

<p align="center">
    <img width="600" src="https://github.com/Lenakeiz/ICN_Programming_Course/blob/main/week_7/joins-sql.png?raw=true">
</p>

When you do an `INNER JOIN` (that is the default in pandas), you merge only those values that are found in both tables. 
On the other hand, when you do the `OUTER (FULL) JOIN`, it merges all values, even if you can find some of them in only one of the tables.

Let’s see a concrete example: did you realize that there is no lion value in zoo_eats? Or that we don’t have any giraffes in zoo? When we did the merge above, by default, it was an INNER merge, so it filtered out giraffes and lions from the result table. But there are cases in which we do want to see these values in our joined dataframe.

In [5]:
zoo.merge(zoo_eats, how='outer')

      animal  uniq_id  water_need        food
0   elephant   1001.0       500.0  vegetables
1   elephant   1002.0       600.0  vegetables
2   elephant   1003.0       550.0  vegetables
3    giraffe      NaN         NaN  vegetables
4   kangaroo   1020.0       410.0  vegetables
5   kangaroo   1021.0       430.0  vegetables
6   kangaroo   1022.0       410.0  vegetables
7       lion   1016.0       420.0         NaN
8       lion   1017.0       600.0         NaN
9       lion   1018.0       500.0         NaN
10      lion   1019.0       390.0         NaN
11     tiger   1004.0       300.0        meat
12     tiger   1005.0       320.0        meat
13     tiger   1006.0       330.0        meat
14     tiger   1007.0       290.0        meat
15     tiger   1008.0       310.0        meat
16     zebra   1009.0       200.0        meat
17     zebra   1010.0       220.0        meat
18     zebra   1011.0       240.0        meat
19     zebra   1012.0       230.0        meat
20     zebra   1013.0       220.0        meat
21     zebra   1014.0       100.0        meat
22     zebra   1015.0        80.0        meat

Lions came back 🦁, the giraffe came back 🦒.

The only thing is that we have empty (`NaN`) values in those columns where we did not get information from the other table.

Let's do some further observation.
In this specific case, it might make more sense to keep lions in the table but not the giraffes.
Since there are no giraffe in our zoo.
In addition, with this choice, we could see all the animals in our zoo and we would have three food categories: vegetables, meat and NaN (which is basically “no information”). 

In order to do so, we would need to say to the merge method we only want to show animals from `zoo` dataframes, not the `zoo_eats` ones. That is precisely what merging with a `how = 'left'` parameter does.

In [6]:
zoo.merge(zoo_eats, how="left", on="animal")

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200        meat
9      zebra     1010         220        meat
10     zebra     1011         240        meat
11     zebra     1012         230        meat
12     zebra     1013         220        meat
13     zebra     1014         100        meat
14     zebra     1015          80        meat
15      lion     1016         420         NaN
16      lion     1017         600         NaN
17      lion     1018         500         NaN
18      lion     1019         390         NaN
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

No more giraffe 🦒!

The `how = 'left'` parameter brought all the values from the left table (`zoo`) but brought only those values from the right table (`zoo_eats`) that we have in the left one, too.

For doing the merge, pandas needs the key-columns you want to base the merge on (in our case it was the `animal` column in both tables). If you are not so lucky that pandas automatically recognizes these key-columns, or if they have different names you have to help it by providing the column names. That is what the `on`, `left_on` and `right_on` parameters are for.

### Sorting
Sorting is essential. The basic sorting method is not too difficult in pandas. 
The function is called `sort_values`.

In [7]:
zoo.sort_values('water_need')

      animal  uniq_id  water_need
14     zebra     1015          80
13     zebra     1014         100
8      zebra     1009         200
9      zebra     1010         220
12     zebra     1013         220
11     zebra     1012         230
10     zebra     1011         240
6      tiger     1007         290
3      tiger     1004         300
7      tiger     1008         310
4      tiger     1005         320
5      tiger     1006         330
18      lion     1019         390
19  kangaroo     1020         410
21  kangaroo     1022         410
15      lion     1016         420
20  kangaroo     1021         430
17      lion     1018         500
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
16      lion     1017         600

For the opposite sorting order it is sufficient to set the boolean parameter `ascending` to `False`.

In [8]:
zoo.sort_values('water_need', ascending=False)

      animal  uniq_id  water_need
1   elephant     1002         600
16      lion     1017         600
2   elephant     1003         550
0   elephant     1001         500
17      lion     1018         500
20  kangaroo     1021         430
15      lion     1016         420
19  kangaroo     1020         410
21  kangaroo     1022         410
18      lion     1019         390
5      tiger     1006         330
4      tiger     1005         320
7      tiger     1008         310
3      tiger     1004         300
6      tiger     1007         290
10     zebra     1011         240
11     zebra     1012         230
12     zebra     1013         220
9      zebra     1010         220
8      zebra     1009         200
13     zebra     1014         100
14     zebra     1015          80

Quite often, you have to sort by multiple columns, so in general, it is recommended using the by keyword for the columns.
The list of keys order sets the order of priority in the sorting.

In [9]:
zoo.sort_values(by=['animal', 'water_need'])

      animal  uniq_id  water_need
0   elephant     1001         500
2   elephant     1003         550
1   elephant     1002         600
19  kangaroo     1020         410
21  kangaroo     1022         410
20  kangaroo     1021         430
18      lion     1019         390
15      lion     1016         420
17      lion     1018         500
16      lion     1017         600
6      tiger     1007         290
3      tiger     1004         300
7      tiger     1008         310
4      tiger     1005         320
5      tiger     1006         330
14     zebra     1015          80
13     zebra     1014         100
8      zebra     1009         200
9      zebra     1010         220
12     zebra     1013         220
11     zebra     1012         230
10     zebra     1011         240

### Indexing

You may have noticed pandas dataframes have an index structure. This can be retrieved by the attribute `index`

In [10]:
zoo.index

RangeIndex(start=0, stop=22, step=1)

You can use the python indexing notation on the `df.loc` and `df.iloc` objects to retrieve entries. 
Note, `loc` stands for location, while `iloc` stands for _index location_.

The main distinction between `loc` and `iloc` is:

* `loc` is label-based, which means that you have to specify rows and columns based on their row and column _labels_.
* `iloc` is integer position-based, so you have to specify rows and columns by their _integer position values_ (0-based integer position).

We report here a table to collect differences and similarities.
<p align="center">
    <img width="1000" src="https://miro.medium.com/max/1400/1*CgAWzayEQY8PQuMpRkSGfQ.png">
</p>

In [11]:
zoo.iloc[3]

animal        tiger
uniq_id        1004
water_need      300
Name: 3, dtype: object

In [12]:
zoo.iloc[lambda x: x.index % 2 == 0]

      animal  uniq_id  water_need
0   elephant     1001         500
2   elephant     1003         550
4      tiger     1005         320
6      tiger     1007         290
8      zebra     1009         200
10     zebra     1011         240
12     zebra     1013         220
14     zebra     1015          80
16      lion     1017         600
18      lion     1019         390
20  kangaroo     1021         430

#### Selecting via a single value
Both loc and iloc allow input to be a single value. We can use the following syntax for data selection:
* `loc[row_label, column_label]`
* `iloc[row_position, column_position]`

When index is numeric, like in our `zoo` example `loc` and `iloc` on rows behaves in the same way.
Let's consider the groupby results.

For example, let’s say we would like to retrieve the 'tiger' water need mean value.
With loc, we can pass the row label 'tiger' and the column label 'water_need'.

In [13]:
grouped_zoo = zoo.groupby("animal").mean()
grouped_zoo

          uniq_id  water_need
animal
elephant   1002.0  550.000000
kangaroo   1021.0  416.666667
lion       1017.5  477.500000
tiger      1006.0  310.000000
zebra      1012.0  184.285714

In [14]:
grouped_zoo.loc["tiger", 'water_need']

np.float64(310.0)

The equivalent `iloc` statement should take the row number `3` and the column number `1`.

In [15]:
grouped_zoo.iloc[3,1]

np.float64(310.0)

There is plenty of other selection choices, hence we refer to [this nice post](https://towardsdatascience.com/how-to-use-loc-and-iloc-for-selecting-data-in-pandas-bd09cb4c3d79) to summarise a further couple of them.


#### Reset_index

Now that we are aware of the indexing structure of dataframes, one may feel in need to reset index order, _e.g._ you may have noticed that after a sorting operation it can happen that all the indexes become shuffled.

Wrong indexing can mess up your visualizations sometimes.

The point is: in certain cases, when you have done a transformation on your dataframe, you have to re-index the rows. For that, you can use the `reset_index()` method.

In [16]:
zoo.sort_values(by=['water_need'], ascending=False).reset_index()

    index    animal  uniq_id  water_need
0       1  elephant     1002         600
1      16      lion     1017         600
2       2  elephant     1003         550
3       0  elephant     1001         500
4      17      lion     1018         500
5      20  kangaroo     1021         430
6      15      lion     1016         420
7      19  kangaroo     1020         410
8      21  kangaroo     1022         410
9      18      lion     1019         390
10      5     tiger     1006         330
11      4     tiger     1005         320
12      7     tiger     1008         310
13      3     tiger     1004         300
14      6     tiger     1007         290
15     10     zebra     1011         240
16     11     zebra     1012         230
17     12     zebra     1013         220
18      9     zebra     1010         220
19      8     zebra     1009         200
20     13     zebra     1014         100
21     14     zebra     1015          80

As you can see, our new dataframe kept the old indexes, too. 
If you want to remove them, just add the `drop = True` parameter.

In [17]:
zoo.sort_values(by=['water_need'], ascending=False).reset_index(drop=True)

      animal  uniq_id  water_need
0   elephant     1002         600
1       lion     1017         600
2   elephant     1003         550
3   elephant     1001         500
4       lion     1018         500
5   kangaroo     1021         430
6       lion     1016         420
7   kangaroo     1020         410
8   kangaroo     1022         410
9       lion     1019         390
10     tiger     1006         330
11     tiger     1005         320
12     tiger     1008         310
13     tiger     1004         300
14     tiger     1007         290
15     zebra     1011         240
16     zebra     1012         230
17     zebra     1013         220
18     zebra     1010         220
19     zebra     1009         200
20     zebra     1014         100
21     zebra     1015          80

### Fillna

Let’s rerun the left-merge method that we have used above. The `NaN` values appearing in lions rows may be something that we want to discard.

In [18]:
zoo.merge(zoo_eats, how='left')

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200        meat
9      zebra     1010         220        meat
10     zebra     1011         240        meat
11     zebra     1012         230        meat
12     zebra     1013         220        meat
13     zebra     1014         100        meat
14     zebra     1015          80        meat
15      lion     1016         420         NaN
16      lion     1017         600         NaN
17      lion     1018         500         NaN
18      lion     1019         390         NaN
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

The problem is that we have NaN values for lions.
`NaN` usually is a problem when we do our data analysis, so one can choose to replace those values with something more meaningful.
Usually to get unbiased results, we substitute the NaN with the mean for that variable.
In some other case we could put a default value, this can be a $0$ value, or in other cases a specific string value. 

In this case even if the `zoo_eat` dataframe gave us no clue about the lion, we will put our best guess.

<div class="alert alert-block alert-info">
⚠️ Of course you never add best guesses to your real data, unless you are 100% you are not biasing your results
</div>

Let’s use the `fillna` method, which basically finds and replaces all `NaN` values in our dataframe.

In [19]:
zoo.merge(zoo_eats, how='left').fillna('meat')

      animal  uniq_id  water_need        food
0   elephant     1001         500  vegetables
1   elephant     1002         600  vegetables
2   elephant     1003         550  vegetables
3      tiger     1004         300        meat
4      tiger     1005         320        meat
5      tiger     1006         330        meat
6      tiger     1007         290        meat
7      tiger     1008         310        meat
8      zebra     1009         200        meat
9      zebra     1010         220        meat
10     zebra     1011         240        meat
11     zebra     1012         230        meat
12     zebra     1013         220        meat
13     zebra     1014         100        meat
14     zebra     1015          80        meat
15      lion     1016         420        meat
16      lion     1017         600        meat
17      lion     1018         500        meat
18      lion     1019         390        meat
19  kangaroo     1020         410  vegetables
20  kangaroo     1021         430  vegetables
21  kangaroo     1022         410  vegetables

---

## A data analysis

Furthermore we are going to use pandas tools to perform an _exploratory data analysis_ over a dataset.

### Import data

An interesting feature of read methods in pandas are that it is allowed to give them a url and they will read data from it.

#### The dataset

We are going to use a famous dataset, the notorious [IMBD movies dataset](MISSING LINK).
The IMDB movie reviews dataset is a set of reviews, there are various versions of it, one can read more about the version used in these lectures in the [official documentation](https://files.grouplens.org/datasets/movielens/ml-latest-README.html). 
The dataset is available online and can be either directly downloaded from Stanford’s website.

In [20]:
# Import data 
df_movies = pd.read_csv("https://raw.githubusercontent.com/LearnDataSci/articles/master/Python%20Pandas%20Tutorial%20A%20Complete%20Introduction%20for%20Beginners/IMDB-Movie-Data.csv", index_col="Title")
df_movies

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,NaN,45.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881,NaN,22.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

One can check the dimensions by a method inherited by numpy.

In [21]:
df_movies.shape

(1000, 11)

Sometime you might have data with duplicated rows (for example if you are writing to your saving file at higher frequency to which you query experimental variables (e.g. keyboard)). In that case you might need to use the `drop_duplicates` method to clear duplicated rows. The function works by checking the content of each row with subsequent one and find a match only when all columns are identical. You will also return a copy of your `DataFrame`.

Another important argument for `drop_duplicates` is `keep`, which has three possible options:

1. `"first"`: (default) Drop duplicates except for the first occurrence.
2. `"last"`: Drop duplicates except for the last occurrence.
3. `False`: Drop all duplicates.

Since we did not indicate the keep argument in the previous example it was defaulted to `"first"`. This means that if two rows are the same pandas will drop the second row and keep the first one. 
Using `last` has the opposite effect: the first row is dropped.

`keep = False`, on the other hand, will drop all duplicates. If two rows are the same then both will be dropped. 
Let's see what happens to `temp_df`.

In [23]:
temp_df = pd.concat([df_movies,df_movies])
# duplicate the entire dataset and append it 
temp_df.drop_duplicates(inplace=True, keep=False)
temp_df.shape

(2000, 11)

Since all rows were duplicates, `keep=False` dropped them all resulting in zero rows being left over.

### Column clean up

Sometimes you will work on other people collected datasets, these datasets might contain verbose column names with symbols, upper and lowercase words, spaces, and typos.
Unless you have a clear instruction of the experiment, how the dataset was collected and what were the exact name of the variables it makes sense to spend a little time cleaning up column names.
Also for how pandas wok with indexing it may be beneficial to change some of the column names.

Here is how to print the column names of our dataset.

In [ ]:
df_movies.columns

Not only does `columns` come in handy if you want to rename columns by allowing for simple copy and paste, it is also useful if you need to understand why you are receiving a Key Error when selecting data by column.

We can use the `rename` method to rename certain or all columns via a dict. We do not want parentheses, so let's rename those.

In [25]:
df_movies = df_movies.rename(columns={
    'Runtime (Minutes)': 'Runtime',
    'Revenue (Millions)': 'Revenue_millions'
})
df_movies.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

Excellent. But what if we want to lowercase all names? 
Instead of using `rename` we could also reassing the column attribute to a list of names like so.

In [27]:
df_movies.columns = [col.lower() for col in df_movies]
df_movies.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

#### Missing values

When exploring data, one most likely encounters missing or null values, which are essentially placeholders for non-existent values. 
Most commonly in these contexts one faces Python's `None` or NumPy's `np.nan`, each of which have to be handled differently according to situations.

There are two options in dealing with nulls:

1. Get rid of rows or columns with nulls
2. Replace nulls with non-null values

Let's calculate to total number of nulls in each column of our dataset. The first step is to check which cells in our DataFrame are null.

In [48]:
df_movies.isnull()

,Rank,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,False,False,False,False,False,False,False,False,False,False,False
Prometheus,False,False,False,False,False,False,False,False,False,False,False
Split,False,False,False,False,False,False,False,False,False,False,False
Sing,False,False,False,False,False,False,False,False,False,False,False
Suicide Squad,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,False,False,False,False,False,False,False,False,False,True,False
Hostel: Part II,False,False,False,False,False,False,False,False,False,False,False
Step Up 2: The Streets,False,False,False,False,False,False,False,False,False,False,False
Search Party,False,False,False,False,False,False,False,False,False,True,False
Nine Lives,False,False,False,False,False,False,False,False,False,False,False

Notice `isnull` returns a DataFrame where each cell is either `True` or `False` depending on that cell's null status.

To count the number of nulls we can use the function any that returns a `Series` of True/False if any of the elements in a single row is True after teh `isnull` function

In [28]:
num_null_rows = df_movies.isnull().any(axis=1).sum()
print("Number of rows with at least one null value:", num_null_rows)

Number of rows with at least one null value: 162

Removing nulls is pretty simple.

In [29]:
df_movies.dropna() # This drops the whole line where a NaN appears.

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore
Title,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0
...,...,...,...,...,...,...,...,...,...,...,...
Resident Evil: Afterlife,994,"Action,Adventure,Horror",While still out to destroy the evil Umbrella C...,Paul W.S. Anderson,"Milla Jovovich, Ali Larter, Wentworth Miller,K...",2010,97,5.9,140900,60.13,37.0
Project X,995,Comedy,3 high school seniors throw a birthday party t...,Nima Nourizadeh,"Thomas Mann, Oliver Cooper, Jonathan Daniel Br...",2012,88,6.7,164088,54.72,48.0
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.54,46.0
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.01,50.0
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435,19.64,11.0

This operation will delete any row with at least a single null value, but it will return a new DataFrame without altering the original one.

Other than just dropping rows, you can also drop columns with null values by setting `axis=1`.

In [30]:
df_movies.dropna(axis=1)

,rank,genre,description,director,actors,year,runtime,rating,votes
Title,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606
Sing,4,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727
...,...,...,...,...,...,...,...,...,...
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699
Search Party,999,"Adventure,Comedy",A pair of friends embark on a mission to reuni...,Scot Armstrong,"Adam Pally, T.J. Miller, Thomas Middleditch,Sh...",2014,93,5.6,4881
Nine Lives,1000,"Comedy,Family,Fantasy",A stuffy businessman finds himself trapped ins...,Barry Sonnenfeld,"Kevin Spacey, Jennifer Garner, Robbie Amell,Ch...",2016,87,5.3,12435

In our dataset, this operation would drop the `revenue_millions` and `metascore` columns.

##### Imputing
Imputation is referred to keeping valuable data replacing the null values.

There may be instances where dropping every row with a null value removes too big a chunk from your dataset, so instead we can impute that null with another value, usually the mean or the median of that column.

Let's look at imputing the missing values in the `revenue_millions` column. First we will extract that column series into its own variable.

In [31]:
revenues = df_movies['revenue_millions']
revenues.sample(15)

Title
Concussion                                                     34.53
The Neighbor                                                     NaN
The Assassination of Jesse James by the Coward Robert Ford      3.90
Bonjour Anne                                                    0.32
Coraline                                                       75.28
A Street Cat Named Bob                                          0.04
Body of Lies                                                   39.38
Jason Bourne                                                  162.16
Elysium                                                          NaN
The Happening                                                  64.51
Zack and Miri Make a Porno                                     31.45
The Girl Next Door                                               NaN
Hands of Stone                                                  4.71
I, Daniel Blake                                                  NaN
Evil Dead                                                      54.24
Name: revenue_millions, dtype: float64

Slightly different formatting than a DataFrame, but we still have our Title index.

We will impute the missing values of revenue using the mean.

__Quick Exercise__: Find the mean of the series.

In [32]:
revenues_mean = revenues.mean()
print("Mean revenue:", revenues_mean)

Mean revenue: 82.95637614678898

The idea is to replace NaN values with the mean.

In [33]:
revenues = revenues.fillna(revenues_mean)
df_movies['revenue_millions'] = revenues
df_movies['revenue_millions'].isnull().sum()

np.int64(0)

---

### Applying functions

Operating on the datasets means that sometimes we will also be required to do more complicated operations on our dataframes entries is ubiquitous. 
The iteration over a DataFrame or Series as you would with a list is possible, however, because of the complex structure of a dataframe, this is really not efficient.

An efficient alternative is to `apply` a function to the dataset.
For example, we could use a function to convert movies with an 8.0 or greater to a string value of `"good"` and the rest to `"bad"` and use this transformed values to create a new column.

First we would create a function that, when given a rating, determines if it's good or bad.

In [34]:
def rating_function(x, value):
    if x >= value:
        return "good"
    else:
        return "bad"

Now we want to send the entire rating column through this function, which is what `apply` does.
This operation is _vectorised_ so taking advantage of the pandas structures, it is more efficient than an explicit for loop.

In [35]:
df_movies["rating_category"] = df_movies["rating"].apply(rating_function, value = 8.0)
df_movies.sample(15)

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore,rating_category
Title,,,,,,,,,,,,
Demain tout commence,357,"Comedy,Drama",Samuel parties hard in the Marseille area of F...,Hugo Gélin,"Omar Sy, Clémence Poésy, Antoine Bertrand, Ash...",2016,118,7.4,5496,82.956376,NaN,bad
Hotel Transylvania 2,789,"Animation,Comedy,Family",Dracula and his friends try to bring out the m...,Genndy Tartakovsky,"Adam Sandler, Andy Samberg, Selena Gomez, Kevi...",2015,89,6.7,69157,169.690000,44.0,bad
The Best of Me,405,"Drama,Romance",A pair of former high school sweethearts reuni...,Michael Hoffman,"James Marsden, Michelle Monaghan, Luke Bracey,...",2014,118,6.7,49041,26.760000,29.0,bad
Annie,982,"Comedy,Drama,Family","A foster kid, who lives with her mean foster m...",Will Gluck,"Quvenzhané Wallis, Cameron Diaz, Jamie Foxx, R...",2014,118,5.3,27312,85.910000,33.0,bad
Tracktown,338,"Drama,Sport","A young, talented, and lonely long-distance ru...",Alexi Pappas,"Alexi Pappas, Chase Offerle, Rachel Dratch, An...",2016,88,5.9,115,82.956376,64.0,bad
Finding Dory,120,"Animation,Adventure,Comedy","The friendly but forgetful blue tang fish, Dor...",Andrew Stanton,"Ellen DeGeneres, Albert Brooks,Ed O'Neill, Kai...",2016,97,7.4,157026,486.290000,77.0,bad
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.020000,40.0,bad
1408,805,"Fantasy,Horror",A man who specializes in debunking paranormal ...,Mikael Håfström,"John Cusack, Samuel L. Jackson, Mary McCormack...",2007,104,6.8,221073,71.980000,64.0,bad
Gods of Egypt,216,"Action,Adventure,Fantasy",Mortal hero Bek teams with the god Horus in an...,Alex Proyas,"Brenton Thwaites, Nikolaj Coster-Waldau, Gerar...",2016,126,5.5,73568,31.140000,25.0,bad
Scouts Guide to the Zombie Apocalypse,922,"Action,Comedy,Horror","Three scouts, on the eve of their last camp-ou...",Christopher Landon,"Tye Sheridan, Logan Miller, Joey Morgan,Sarah ...",2015,93,6.3,31651,3.640000,32.0,bad
American Honey,226,Drama,A teenage girl with nothing to lose joins a tr...,Andrea Arnold,"Sasha Lane, Shia LaBeouf, Riley Keough, McCaul...",2016,163,7.0,19660,0.660000,79.0,bad
Christine,824,"Biography,Drama","The story of Christine Chubbuck, a 1970s TV re...",Antonio Campos,"Rebecca Hall, Michael C. Hall, Tracy Letts, Ma...",2016,119,7.0,5855,0.300000,72.0,bad
The Road,756,"Adventure,Drama","In a dangerous post-apocalyptic world, an aili...",John Hillcoat,"Viggo Mortensen, Charlize Theron, Kodi Smit-Mc...",2009,111,7.3,187302,0.060000,NaN,bad
RocknRolla,323,"Action,Crime,Thriller","In London, a real-estate scam puts millions of...",Guy Ritchie,"Gerard Butler, Tom Wilkinson, Idris Elba, Than...",2008,114,7.3,203096,5.690000,53.0,bad
World War Z,433,"Action,Adventure,Horror",Former United Nations employee Gerry Lane trav...,Marc Forster,"Brad Pitt, Mireille Enos, Daniella Kertesz, Ja...",2013,116,7.0,494819,202.350000,63.0,bad

The `apply` method passes every value in the rating column through the `rating_function` and then returns a new Series.
This Series is then assigned to a new column called `rating_category`.

You can also use anonymous functions as well. This `lambda` function achieves the same result as `rating_function`.

In [38]:
my_lambada = lambda x: 'good' if x >= 8.0 else 'bad' # check if you can input to the lambda expression

df_movies["rating_category"] = df_movies["rating"].apply(
    my_lambada)
df_movies.sample(20)

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore,rating_category
Title,,,,,,,,,,,,
The Descendants,952,"Comedy,Drama",A land baron tries to reconnect with his two d...,Alexander Payne,"George Clooney, Shailene Woodley, Amara Miller...",2011,115,7.3,211348,82.620000,84.0,bad
Ben-Hur,370,"Action,Adventure,Drama","Judah Ben-Hur, a prince falsely accused of tre...",Timur Bekmambetov,"Jack Huston, Toby Kebbell, Rodrigo Santoro,Naz...",2016,123,5.7,28326,26.380000,38.0,bad
The imposible,438,"Drama,Thriller",The story of a tourist family in Thailand caug...,J.A. Bayona,"Naomi Watts, Ewan McGregor, Tom Holland, Oakle...",2012,114,7.6,156189,19.000000,73.0,bad
Shame,420,Drama,A man's carefully cultivated private life is d...,Steve McQueen,"Michael Fassbender, Carey Mulligan, James Badg...",2011,101,7.2,155010,4.000000,72.0,bad
Keanu,391,"Action,Comedy",When an L.A. drug kingpin's kitten unexpectedl...,Peter Atencio,"Keegan-Michael Key, Jordan Peele, Tiffany Hadd...",2016,100,6.3,31913,20.570000,63.0,bad
Lovesong,322,Drama,The relationship between two friends deepens d...,So Yong Kim,"Riley Keough, Jena Malone, Jessie Ok Gray, Car...",2016,84,6.4,616,0.010000,74.0,bad
Pirates of the Caribbean: At World's End,76,"Action,Adventure,Fantasy","Captain Barbossa, Will Turner and Elizabeth Sw...",Gore Verbinski,"Johnny Depp, Orlando Bloom, Keira Knightley,Ge...",2007,169,7.1,498821,309.400000,50.0,bad
Avatar,88,"Action,Adventure,Fantasy",A paraplegic marine dispatched to the moon Pan...,James Cameron,"Sam Worthington, Zoe Saldana, Sigourney Weaver...",2009,162,7.8,935408,760.510000,83.0,bad
Bronson,403,"Action,Biography,Crime",A young man who was sentenced to seven years i...,Nicolas Winding Refn,"Tom Hardy, Kelly Adams, Luing Andrews,Katy Barker",2008,92,7.1,93972,0.100000,NaN,bad
Friend Request,532,"Horror,Thriller",When a college student unfriends a mysterious ...,Simon Verhoeven,"Alycia Debnam-Carey, William Moseley, Connor P...",2016,92,5.4,12758,64.030000,59.0,bad
The Dark Knight,55,"Action,Crime,Drama",When the menace known as the Joker wreaks havo...,Christopher Nolan,"Christian Bale, Heath Ledger, Aaron Eckhart,Mi...",2008,152,9.0,1791916,533.320000,82.0,good
Wrecker,969,"Action,Horror,Thriller",Best friends Emily and Lesley go on a road tri...,Micheal Bafaro,"Anna Hutchison, Andrea Whitburn, Jennifer Koen...",2015,83,3.5,1210,82.956376,37.0,bad
Megamind,600,"Animation,Action,Comedy",The supervillain Megamind finally defeats his ...,Tom McGrath,"Will Ferrell, Jonah Hill, Brad Pitt, Tina Fey",2010,95,7.3,183926,148.340000,63.0,bad
Allied,72,"Action,Drama,Romance","In 1942, a Canadian intelligence officer in No...",Robert Zemeckis,"Brad Pitt, Marion Cotillard, Jared Harris, Vin...",2016,124,7.1,78079,40.070000,60.0,bad
The Blackcoat's Daughter,737,"Horror,Thriller",Two girls must battle a mysterious evil force ...,Oz Perkins,"Emma Roberts, Kiernan Shipka, Lauren Holly, Lu...",2015,93,5.6,4155,0.020000,68.0,bad
Harry Potter and the Deathly Hallows: Part 2,115,"Adventure,Drama,Fantasy","Harry, Ron and Hermione search for Voldemort's...",David Yates,"Daniel Radcliffe, Emma Watson, Rupert Grint, M...",2011,130,8.1,590595,380.960000,87.0,good
Winter's Bone,607,Drama,An unflinching Ozark Mountain girl hacks throu...,Debra Granik,"Jennifer Lawrence, John Hawkes, Garret Dillahu...",2010,100,7.2,116435,82.956376,NaN,bad
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,82.956376,45.0,bad
The Adjustment Bureau,707,"Romance,Sci-Fi,Thriller",The affair between a politician and a contempo...,George Nolfi,"Matt Damon, Emily Blunt, Lisa Thoreson, Floren...",2011,106,7.1,208632,62.450000,NaN,bad
Locke,864,Drama,"Ivan Locke, a dedicated family man and success...",Steven Knight,"Tom Hardy, Olivia Colman, Ruth Wilson, Andrew ...",2013,85,7.1,100890,1.360000,81.0,bad

#### Pandas pipe

When working with data, we often need to apply multiple transformations sequentially—for instance, for example first cleaning the data (removing null values), then filtering rows based on certain criteria. The [`pipe`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.pipe.html) method provides an elegant way to chain these transformations together.

Instead of nesting function calls or using intermediate variables, `pipe` lets you write transformations as a readable pipeline:

```python
df_movies.pipe(remove_null).pipe(drop_genre, "Comedy")
```

Each function in the pipeline must:
1. Accept a DataFrame as its **first parameter**
2. **Return** a DataFrame (which becomes the input for the next step)

Additional arguments can be passed after the function name (e.g., `"Comedy"` is passed to `drop_genre`).

Let's define two transformation functions to see this in action:

In [39]:
# Define functions

def remove_null(df_movies):
    """remove null values
    
    Parameters
    ----------
    df: pd.DataFrame
        the base dataframe
    
    Returns
    -------
    pd.DataFrame
        the dataframe with null values removed
    """
    return df_movies.dropna()

def drop_genre(df_movies, genre):
    """remove a specific genre movies
    
    Parameters
    ----------
    df: pd.DataFrame
        the base dataframe
    
    genre: str
        the movie genre to be removed.
    
    Returns
    -------
    pd.DataFrame
        the filtered dataframe 
    """
    series_remove = df_movies.genre.str.contains(f"{genre}") # Boolean series
    idx_to_drop = series_remove[series_remove].index # Find indices in the series and use them to drop rows from the dataframe
    print(f"Removing {len(idx_to_drop)} rows")
    print(idx_to_drop)
    return df_movies.drop(index=idx_to_drop)

We can easily build a pipeline over a dataframe by calling `pipe`.

In [41]:
(df_movies.pipe(remove_null)
    .pipe(drop_genre, "Comedy"))

Removing 268 rows
Index(['Sing', 'La La Land', 'Mindhorn', 'Moana', 'Colossal',
       'The Secret Life of Pets', 'Trolls', 'Bad Moms', 'Why Him?', 'Deadpool',
       ...
       'That Awkward Moment', 'Rock of Ages', 'My Big Fat Greek Wedding 2',
       'Amateur Night', 'Annie', 'Let's Be Cops', 'Your Highness', 'Project X',
       'Search Party', 'Nine Lives'],
      dtype='object', name='Title', length=268)

,rank,genre,description,director,actors,year,runtime,rating,votes,revenue_millions,metascore,rating_category
Title,,,,,,,,,,,,
Guardians of the Galaxy,1,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.130000,76.0,good
Prometheus,2,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.460000,65.0,bad
Split,3,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.120000,62.0,bad
Suicide Squad,5,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.020000,40.0,bad
The Great Wall,6,"Action,Adventure,Fantasy",European mercenaries searching for black powde...,Yimou Zhang,"Matt Damon, Tian Jing, Willem Dafoe, Andy Lau",2016,103,6.1,56036,45.130000,42.0,bad
...,...,...,...,...,...,...,...,...,...,...,...,...
Taare Zameen Par,992,"Drama,Family,Music",An eight-year-old boy is thought to be a lazy ...,Aamir Khan,"Darsheel Safary, Aamir Khan, Tanay Chheda, Sac...",2007,165,8.5,102697,1.200000,42.0,good
Resident Evil: Afterlife,994,"Action,Adventure,Horror",While still out to destroy the evil Umbrella C...,Paul W.S. Anderson,"Milla Jovovich, Ali Larter, Wentworth Miller,K...",2010,97,5.9,140900,60.130000,37.0,bad
Secret in Their Eyes,996,"Crime,Drama,Mystery","A tight-knit team of rising investigators, alo...",Billy Ray,"Chiwetel Ejiofor, Nicole Kidman, Julia Roberts...",2015,111,6.2,27585,82.956376,45.0,bad
Hostel: Part II,997,Horror,Three American college students studying abroa...,Eli Roth,"Lauren German, Heather Matarazzo, Bijou Philli...",2007,94,5.5,73152,17.540000,46.0,bad
Step Up 2: The Streets,998,"Drama,Music,Romance",Romantic sparks occur between two dance studen...,Jon M. Chu,"Robert Hoffman, Briana Evigan, Cassie Ventura,...",2008,98,6.2,70699,58.010000,50.0,bad